In [1]:
import numpy as np
import pandas as pd

In [2]:
#Import Dataset

In [3]:
data = pd.read_csv('https://raw.githubusercontent.com/SeliyaMindula/ML_Assignment2_IT19151298_IT19149936_IT19006208_IT19179186/IT19006208-Ranathunga_J.K/Employee.csv')
data.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [4]:
#Display Number of Rows, Colums

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   object
 1   JoiningYear                4653 non-null   int64
 2   City                       4653 non-null   object
 3   PaymentTier                4653 non-null   int64
 4   Age                        4653 non-null   int64
 5   Gender                     4653 non-null   object
 6   EverBenched                4653 non-null   object
 7   ExperienceInCurrentDomain  4653 non-null   int64
 8   LeaveOrNot                 4653 non-null   int64
dtypes: int64(5), object(4)
memory usage: 327.3+ KB

In [6]:
#Number of Missing Values in the Dataset

In [7]:
data.isnull().sum()

Education                    0
JoiningYear                  0
City                         0
PaymentTier                  0
Age                          0
Gender                       0
EverBenched                  0
ExperienceInCurrentDomain    0
LeaveOrNot                   0
dtype: int64

In [8]:
data.shape

(4653, 9)

In [9]:
data['Education'].value_counts()

Bachelors    3601
Masters       873
PHD           179
Name: Education, dtype: int64

In [10]:
def Gender_convert(inp):
    if inp=='Male':
        return '0'
    if inp=='Female':
        return '1'
data['Gender']= data['Gender'].apply(Gender_convert)

In [11]:
data['Gender']

0       0
1       1
2       1
3       0
4       0
       ..
4648    1
4649    0
4650    0
4651    0
4652    0
Name: Gender, Length: 4653, dtype: object

In [12]:
data['Gender'] = pd.to_numeric(data['Gender'])

In [13]:
data['Gender']

0       0
1       1
2       1
3       0
4       0
       ..
4648    1
4649    0
4650    0
4651    0
4652    0
Name: Gender, Length: 4653, dtype: int64

In [14]:
data['Education']

0       Bachelors
1       Bachelors
2       Bachelors
3         Masters
4         Masters
          ...
4648    Bachelors
4649      Masters
4650      Masters
4651    Bachelors
4652    Bachelors
Name: Education, Length: 4653, dtype: object

In [15]:
def Education_convert(inp):
    if inp=='Bachelors':
        return '0'
    if inp=='Masters':
        return '1'
    if inp=='PHD':
        return '2'
data['Education']= data['Education'].apply(Education_convert)

In [16]:
data['Education']

0       0
1       0
2       0
3       1
4       1
       ..
4648    0
4649    1
4650    1
4651    0
4652    0
Name: Education, Length: 4653, dtype: object

In [17]:
data['Education'] = pd.to_numeric(data['Education'])

In [18]:
data['Education']

0       0
1       0
2       0
3       1
4       1
       ..
4648    0
4649    1
4650    1
4651    0
4652    0
Name: Education, Length: 4653, dtype: int64

In [19]:
data['City']

0       Bangalore
1            Pune
2       New Delhi
3       Bangalore
4            Pune
          ...
4648    Bangalore
4649         Pune
4650    New Delhi
4651    Bangalore
4652    Bangalore
Name: City, Length: 4653, dtype: object

In [20]:
data['City'].value_counts()

Bangalore    2228
Pune         1268
New Delhi    1157
Name: City, dtype: int64

In [21]:
def City_convert(inp):
    if inp=='Bangalore':
        return '0'
    if inp=='Pune':
        return '1'
    if inp=='New Delhi':
        return '2'
data['City']= data['City'].apply(City_convert)

In [22]:
data['City'] = pd.to_numeric(data['City'])

In [23]:
data['City']

0       0
1       1
2       2
3       0
4       1
       ..
4648    0
4649    1
4650    2
4651    0
4652    0
Name: City, Length: 4653, dtype: int64

In [24]:
 data['EverBenched'].value_counts()

No     4175
Yes     478
Name: EverBenched, dtype: int64

In [25]:
def EverBenched_convert(inp):
    if inp=='No':
        return '0'
    if inp=='Yes':
        return '1'
data['EverBenched']= data['EverBenched'].apply(EverBenched_convert)

In [26]:
data['EverBenched'] = pd.to_numeric(data['EverBenched'])

In [27]:
data['EverBenched']

0       0
1       0
2       0
3       0
4       1
       ..
4648    0
4649    0
4650    0
4651    1
4652    1
Name: EverBenched, Length: 4653, dtype: int64

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   int64
 1   JoiningYear                4653 non-null   int64
 2   City                       4653 non-null   int64
 3   PaymentTier                4653 non-null   int64
 4   Age                        4653 non-null   int64
 5   Gender                     4653 non-null   int64
 6   EverBenched                4653 non-null   int64
 7   ExperienceInCurrentDomain  4653 non-null   int64
 8   LeaveOrNot                 4653 non-null   int64
dtypes: int64(9)
memory usage: 327.3 KB